ids = [
    ("HFvmQVuPEPXjCtKcwhkdgw==", True),  # 无法解析 `综合评标报价数量（具体计算方式详见竞争性谈判文件）:63508900(个)` 的 单位：个
    ("3blQqEKMJTp5vA/nwHxEyQ==", True),  # 出现新的联系方式内容
    ("ZvOzhg1RKg+dmWpbNvRmjg==", True),  # 出现新的联系方式内容
    ("q1IZcA/AbJNK3E9PVoEj8w==", True),  # 基本情况解析失败：匹配失败
    ("eYzauHOtG6x+vUC8Cne+tA==", True),  # 出现新的联系方式内容
    ("YMQ9xSpUGjhcXYg/8ABU9w==", True),  # 出现新的联系方式内容
    ("/Etr+86hUAeaGpy5DeN/9A==", True),  # 出现新的联系方式内容
    ("1bdhb7KWYUQebHgwgZ2qcg==", True),  # 无法解析废标原因: （桂政办发〔2021〕78号）已废止招标文件引用的桂政办发【2015】78 号文内容，招标文件A分标存在重大缺陷应当停止评标工作。
    ("/s9fMyGqg62CdFxN32n7GQ==", True),  # 出现新的联系方式内容
    ("WQ8abkQEtXMu/q71QT0vlA==", True),  # 出现新的联系方式内容
    ("GunwpkOUc1dFIoA9D1ew5A==", True),  # 出现新的联系方式内容
    ("CrHSbiDxa1Ve9Bt0K0yNJw==", True),  # 出现新的联系方式内容
    ("bf1jc2KDHK/kWP8DsheI4g==", True),  # 出现新的联系方式内容
    ("2LUpImbK6pMKGMyl8PbV/w==", True),  # 基本情况解析失败：匹配失败
    ("W1Eg9aGXy3zvtIsVar88ng==", True),  # 出现新的联系方式内容
    ("p7ca7xDVD9iq+PR27GSvJA==", True),  # 无法解析废标原因: 南宁太浩建筑工程有限公司,不符合,说明:3.投标文件承诺部分直接复制采购需求 3.采购文件第57页，货物需求偏离表：4.如果采购需求为小于、小于等于、大于或大于等于某个数值标准时，响应文件承诺不得直接复制采购需求，响应文件承诺内容应当写明竞标货物具体参数或商务响应承诺的具体数值，否则按竞标 无效处理。如该采购需求属于不能明确具体数值的，采购人应在此采购需求的数值后标注◆号，对标注◆号的采购需求不 适用上述“竞标无效”条款。3.按照采购文件要求：响应文件承诺不得直接复制采购需求，供货商存在直接复制采购需求现象。 广西恒安建设工程有限公司,不符合,说明:3.投标文件承诺部分直接复制采购需求 3. 采购文件第57页，货物需求偏离表：4.如果采购需求为小于、小于等于、大于或大于等于某个数值标准时，响应文件承诺不得直接复制采购需求，响应文件承诺内容应当写明竞标货物具体参数或商务响应承诺的具体数值，否则按竞标无效处理。如该采购需求属于不能明确具体数值的，采购人应在此采购需求的数值后标注◆号，对标注◆号的采购需求不适用上述“竞标无效”条款。3.按照采购文件要求：响应文件承诺不得直接复制采购需求，供货商存在直接复制采购需求现象。 广西掘鑫环保科技有限公司,不符合,说明:3.投标文件承诺部分直接复制采购需求。3.采购文件第57页，货物需求偏离表：4.如果采购需求为小于、小于等于、大于或大于等于某个数值标准时，响应文件承诺不得直接复制采购需求，响应文件承诺内容应当写明竞标货物具体参数或商 务响应承诺的具体数值，否则按竞标无效处理。如该采购需求属于不能明确具体数值的，采购人应在此采购需求的数值后 标注◆号，对标注◆号的采购需求不适用上述“竞标无效”条款。3.按照采购文件要求：响应文件承诺不得直接复制采购需求，供货商存在直接复制采购需求现象。广西海登科技有限公司,不符合,说明:3.投标文件承诺部分直接复制采购需求 3.采购文件第57页，货物需求偏离表：4.如果采购需求为小于、小于等于、大于或大于等于某个数值标准时，响应文件承诺不得直接复制采购需求，响应文件承诺内容应当写明竞标货物具体参数或商务响应承诺的具体数值，否则按竞标无效处理。如该采购需求属于不能明确具体数值的，采购人应在此采购需求的数值后标注◆号，对标注◆号的采购需求不适用上述“竞标无效”条款。3.按照采购文件要求：响应文件承诺不得直接复制采购需求，供货商存在直接复制采购需求现象。
    ("iA72NY+PjZFUX7TxikmKsg==", True),  # 出现新的联系方式内容
    ("o2x/2Ir+ydlBDN8+rzMuHA==", True),  # 出现新的联系方式内容
    ("YVjXEBJ0KIzP1XdERkkmHw==", True),  # 出现新的联系方式内容
    ("JE8oaPF2mKCz4baI3DgoHg==", True),  # 标项名称不一致
    ("073q0A/OttY2+fxPs1s4xA==", True),  # 出现特殊的中标信息格式
    ("RJs8CSeqcvWgM0745eodQQ==", True),  # 出现新的联系方式内容
    ("SzEhreA6GaN6XLhqmr6HYQ==", True),  # 出现新的联系方式内容
    ("dDn271dGhY2iAW+3Zcd1dw==", True),  # 无法解析废标原因: 本项目在系统生成项目时没有分标项生成，导致报价评审无法进行，故本项目作废标处理
    ("hrnv6faqn9h+ijB9ZIFNUQ==", True),  # 标项数量不一致
    ("3blQqEKMJTp5vA/nwHxEyQ==", True),  # 出现新的联系方式内容
    ("ZvOzhg1RKg+dmWpbNvRmjg==", True),  # 出现新的联系方式内容
    ("eYzauHOtG6x+vUC8Cne+tA==", True),  # 出现新的联系方式内容
    ("YMQ9xSpUGjhcXYg/8ABU9w==", True),  # 出现新的联系方式内容
    ("/Etr+86hUAeaGpy5DeN/9A==", True),  # 出现新的联系方式内容
    ("/s9fMyGqg62CdFxN32n7GQ==", True),  # 出现新的联系方式内容
    ("GunwpkOUc1dFIoA9D1ew5A==", True),  # 出现新的联系方式内容
    ("CrHSbiDxa1Ve9Bt0K0yNJw==", True),  # 出现新的联系方式内容
    ("bf1jc2KDHK/kWP8DsheI4g==", True),  # 出现新的联系方式内容
    ("W1Eg9aGXy3zvtIsVar88ng==", True),  # 出现新的联系方式内容
    ("p7ca7xDVD9iq+PR27GSvJA==", True),  # 无法解析废标原因: 南宁太浩建筑工程有限公司,不符合,说明:3.投标文件承诺部分直接复制采购需求 3.采购文件第57页，货物需求偏离表：4.如果采购需求为小于、小于等于、大于或大于等于某个数值标准时，响应文件承诺不得直接复制采购需求，响应文件承诺内容应当写明竞标货物具体参数或商务响应承诺的具体数值，否则按竞标 无效处理。如该采购需求属于不能明确具体数值的，采购人应在此采购需求的数值后标注◆号，对标注◆号的采购需求不 适用上述“竞标无效”条款。3.按照采购文件要求：响应文件承诺不得直接复制采购需求，供货商存在直接复制采购需求现象。 广西恒安建设工程有限公司,不符合,说明:3.投标文件承诺部分直接复制采购需求 3. 采购文件第57页，货物需求偏离表：4.如果采购需求为小于、小于等于、大于或大于等于某个数值标准时，响应文件承诺不得直接复制采购需求，响应文件承诺内容应当写明竞标货物具体参数或商务响应承诺的具体数值，否则按竞标无效处理。如该采购需求属于不能明确具体数值的，采购人应在此采购需求的数值后标注◆号，对标注◆号的采购需求不适用上述“竞标无效”条款。3.按照采购文件要求：响应文件承诺不得直接复制采购需求，供货商存在直接复制采购需求现象。 广西掘鑫环保科技有限公司,不符合,说明:3.投标文件承诺部分直接复制采购需求。3.采购文件第57页，货物需求偏离表：4.如果采购需求为小于、小于等于、大于或大于等于某个数值标准时，响应文件承诺不得直接复制采购需求，响应文件承诺内容应当写明竞标货物具体参数或商 务响应承诺的具体数值，否则按竞标无效处理。如该采购需求属于不能明确具体数值的，采购人应在此采购需求的数值后 标注◆号，对标注◆号的采购需求不适用上述“竞标无效”条款。3.按照采购文件要求：响应文件承诺不得直接复制采购需求，供货商存在直接复制采购需求现象。广西海登科技有限公司,不符合,说明:3.投标文件承诺部分直接复制采购需求 3.采购文件第57页，货物需求偏离表：4.如果采购需求为小于、小于等于、大于或大于等于某个数值标准时，响应文件承诺不得直接复制采购需求，响应文件承诺内容应当写明竞标货物具体参数或商务响应承诺的具体数值，否则按竞标无效处理。如该采购需求属于不能明确具体数值的，采购人应在此采购需求的数值后标注◆号，对标注◆号的采购需求不适用上述“竞标无效”条款。3.按照采购文件要求：响应文件承诺不得直接复制采购需求，供货商存在直接复制采购需求现象。
    ("iA72NY+PjZFUX7TxikmKsg==", True),  # 出现新的联系方式内容
    ("o2x/2Ir+ydlBDN8+rzMuHA==", True),  # 出现新的联系方式内容
    ("YVjXEBJ0KIzP1XdERkkmHw==", True),  # 出现新的联系方式内容
    ("RJs8CSeqcvWgM0745eodQQ==", True),  # 出现新的联系方式内容
    ("SzEhreA6GaN6XLhqmr6HYQ==", True),  # 出现新的联系方式内容
    ("dDn271dGhY2iAW+3Zcd1dw==", True),  # 无法解析废标原因: 本项目在系统生成项目时没有分标项生成，导致报价评审无法进行，故本项目作废标处理
    ("hrnv6faqn9h+ijB9ZIFNUQ==", True),  # 标项数量不一致
]
